schedule.md


# SCHEDULE

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DATE</th>
<th scope="col" class="org-left">LECTURES/GLOSSARY/LABS</th>
<th scope="col" class="org-left">PROTOCOL</th>
<th scope="col" class="org-left">PROJECT</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">17-Aug</td>
<td class="org-left">Course overview &amp; purpose</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">19-Aug</td>
<td class="org-left">Course project</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">24-Aug</td>
<td class="org-left">Complex problems</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">26-Aug</td>
<td class="org-left">Many-model thinking</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">31-Aug</td>
<td class="org-left">Decision intelligence</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">2-Sep</td>
<td class="org-left">Literature reviews</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">7-Sep</td>
<td class="org-left">Agile management methods</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">9-Sep</td>
<td class="org-left">PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1ST SPRINT REVIEW</td>
</tr>


<tr>
<td class="org-left">14-Sep</td>
<td class="org-left">Project work</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">16-Sep</td>
<td class="org-left">REDCAPE Model categories</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">21-Sep</td>
<td class="org-left">Storytelling (Modeling human actors)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">23-Sep</td>
<td class="org-left">CANCELLED (Day of Renewal)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">28-Sep</td>
<td class="org-left">User stories (Modeling human actors)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">30-Sep</td>
<td class="org-left">MIDTERM EXAM + Outlook</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MIDTERM EXAM</td>
</tr>


<tr>
<td class="org-left">7-Oct</td>
<td class="org-left">PRESENTATIONS: Chaney, Sonnier, Hardin, Sampley</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2ND SPRINT REVIEW</td>
</tr>


<tr>
<td class="org-left">12-Oct</td>
<td class="org-left">PRESENTATIONS: Roach/Czerwinski, Norwood, Hernandez, Mellor, Frerichs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2ND SPRINT REVIEW</td>
</tr>


<tr>
<td class="org-left">14-Oct</td>
<td class="org-left">Event controlled Process Chains I</td>
<td class="org-left">Nick Czerwinski</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">19-Oct</td>
<td class="org-left">Event controlled Process Chains II</td>
<td class="org-left">Wyatt Frerichs</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">21-Oct</td>
<td class="org-left">Business Process Model and Notation I</td>
<td class="org-left">Own Hardin</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">26-Oct</td>
<td class="org-left">Business Process Model and Notation II</td>
<td class="org-left">Fortunato Hernandez</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">28-Oct</td>
<td class="org-left">Unified Modeling Language (UML) I</td>
<td class="org-left">Malcolm Howard</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">2-Nov</td>
<td class="org-left">Unified Modeling Language (UML) II</td>
<td class="org-left">Molly Mellor</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">4-Nov</td>
<td class="org-left">PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3RD SPRINT REVIEW</td>
</tr>


<tr>
<td class="org-left">9-Nov</td>
<td class="org-left">Robotic process automation (RPA) I</td>
<td class="org-left">Nick Norwood</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">11-Nov</td>
<td class="org-left">Robotic process automation (RPA) II</td>
<td class="org-left">Dat O</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">16-Nov</td>
<td class="org-left">Entity Relationship Diagrams (ERD) I</td>
<td class="org-left">Dane Roach</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">18-Nov</td>
<td class="org-left">Entity Relationship Diagrams (ERD) II</td>
<td class="org-left">Jacob Sampley</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">23-Nov</td>
<td class="org-left">Process mining I</td>
<td class="org-left">William Sonnier</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">30-Nov</td>
<td class="org-left">Process mining II</td>
<td class="org-left">Nick Chaney</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">2-Dec</td>
<td class="org-left">PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4TH SPRINT REVIEW</td>
</tr>


<tr>
<td class="org-left">Dec 6-10</td>
<td class="org-left">FINAL EXAM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">FINAL EXAM</td>
</tr>
</tbody>
</table>

